{"codes":[{"id":26,"title":9,"chapter":4,"section":25,"subsection":"","header":"Bicycle safety violation - Penalty","body":"<p>(a) (1) Any person who violates subsection (e) or (f) of Section 9-16-020, subsection (c) of Section 9-36-010, or Section 9-40-060, of this Code, shall be subject to a fine of $150.00 for each offense.\n<br \/>(2) Any person who violates subsection (e) or (f) of Section 9-16-020, subsection (c) of Section 9-36-010, or Section 9-40-060, of this Code, when such violation causes a collision between a motor vehicle and a bicycle, shall be subject to a fine of $500.00 for each offense.<\/p>\n<p>(b) (1) Any person who violates Section 9-40-160 of this Code, when such violation interferes with the movement of a bicycle, shall be subject to a fine of $150.00 for each offense.\n<br \/>(2) Any person who violates Section 9-40-160 of this Code, when such violation causes a collision between a motor vehicle and a bicycle, shall be subject to a fine of $500.00 for each offense.\n<p>(c) (1) Any person who violates Section 9-80-035 of this Code, when such violation interferes with the movement of a bicycle, shall be subject to a fine of $300.00 for each offense.\n<br \/>(2) Any person who violates Section 9-80-035 of this Code, when such violation causes a collision between a motor vehicle and a bicycle, shall be subject to a fine of $1,000.00 for each offense.<\/p>","keyword":"","codeLocation":"Added Coun. J. 3-12-08, p. 22781, § 2; Amend Coun. J. 6-5-13, p. 54983, § 1","legislature":"Chicago","stub":"penalties"},{"id":56,"title":9,"chapter":8,"section":20,"subsection":"","header":"Traffic-control signal legend","body":"<p>Whenever traffic is controlled by traffic-control devices exhibiting steady colored lights, successively one at a time, in combination or with arrows, the following colors only shall be used and the signals shall indicate and apply to drivers of vehicles and pedestrians as follows:<\/p>\n<p>(a) Green Indication.\n<br \/>(1) Vehicular traffic facing a circular green signal may proceed straight through or turn right or left except as such movement is modified by lane-control signs, turn prohibition signs, lane markings, or roadway design. Vehicular traffic, including vehicles turning right or left, shall yield the right-of-way to other vehicles and to pedestrians lawfully within the intersection or an adjacent crosswalk at the time such signal indication is exhibited.\n<br \/>(2) Vehicular traffic facing a green arrow signal, shown alone or in combination with another indication, may cautiously enter the intersection only to make the movement indicated by such arrow or such other movement as is permitted by other indications shown at the same time. Such vehicular traffic shall yield the right-of-way to pedestrians lawfully within an adjacent crosswalk and to other traffic lawfully using the intersection.\n<br \/>(3) Unless otherwise directed by a pedestrian-control signal as provided in Section 9-8-050, pedestrians facing any green signal, except when the sole green signal is a turn arrow, may proceed across the roadway within any marked or unmarked crosswalk.<\/p>\n<p>(b) Steady Yellow Indication.\n<br \/>(1) Vehicular traffic facing a steady circular yellow or yellow arrow signal is thereby warned that the related green movement is being terminated or that a red indication will be exhibited immediately thereafter when vehicular traffic shall not enter the intersection.\n<br \/>(2) Pedestrians facing a steady circular yellow or yellow arrow signal, unless otherwise directed by a pedestrian-control signal as provided in Section 9-8-050, are thereby advised that there is insufficient time to cross the roadway before a red indication is shown, and no pedestrian shall then start to cross the roadway.<\/p>\n<p>(c) Steady Red Indication.\n<br \/>(1) Except as provided in Section 9-16-030, vehicular traffic facing a steady circular red signal alone shall stop at a clearly marked stop line, but if none, before entering the crosswalk on the near side of the intersection, or if none, then before entering the intersection and shall remain standing until an indication to proceed is shown.\n<br \/>(2) Except as provided in Section 9-16-030, vehicular traffic facing a steady red arrow signal shall not enter the intersection to make the movement indicated by the arrow and, unless entering the intersection to make a movement permitted by another signal, shall stop at a clearly marked stop line, but if none, before entering the crosswalk on the near side of the intersection, or if none, then before entering the intersection and shall remain standing until an indication permitting the movement indicated by such red arrow is shown.<\/p>","keyword":"","codeLocation":"Added Coun. J. 7-12-90, p. 18634","legislature":"Chicago","stub":"traffic_signal_legend"},{"id":59,"title":9,"chapter":8,"section":50,"subsection":"","header":"Special pedestrian-control signals","body":"<p>Whenever special pedestrian-control signals are in place, such signals shall indicate as follows:<\/p>\n<p>(a) Walk or Symbolic Walk Figure. Pedestrians facing such signal indication when illuminated may proceed across the roadway in the direction of the indication and shall be given the right-of-way by the operator of any vehicle. When such signal indication is extinguished, no pedestrian facing the signal indication shall enter the roadway.<\/p>\n<p>(b) Don't Walk or Symbolic Don't Walk Figure. No pedestrian facing such signal indication which is illuminated or flashing shall start to cross the roadway in the direction of the indication; provided, however, any pedestrian who has partially completed his crossing on the “Walk” signal indication shall proceed to a sidewalk or safety zone while the “Don't Walk” signal indication is illuminated.<\/p>","keyword":"walk sign button","codeLocation":"Added Coun. J. 7-12-90, p. 18634","legislature":"Chicago","stub":"special_pedestrian_signals"},{"id":21,"title":9,"chapter":16,"section":20,"subsection":"e","header":"Right of way to a bicycle on Left Turn","body":"The driver of a vehicle within an intersection intending to turn to the left shall yield the right of way to a bicycle approaching from the opposite direction which is within the intersection or so close thereto as to constitute an immediate hazard.","keyword":"left hook left cross","codeLocation":"Added Coun. J. 3-12-08, p. 22783, § 1","legislature":"Chicago","stub":"no_left_hook"},{"id":22,"title":9,"chapter":16,"section":20,"subsection":"f","header":"Turning right in front of a bicycle","body":"When a motor vehicle and a bicycle are traveling in the same direction on any highway, street, or road, the operator of the motor vehicle overtaking such bicycle traveling on the right side of the roadway shall not turn to the right in front of the bicycle at that intersection or at any alley or driveway until such vehicle has overtaken and is safely clear of the bicycle.","keyword":"right hook right cross","codeLocation":"Added Coun. J. 3-12-08, p. 22783","legislature":"Chicago","stub":"no_right_hook"},{"id":57,"title":9,"chapter":24,"section":30,"subsection":"","header":"Crosswalks – Pedestrians to have right- of-way","body":"Where stop signs are in place at any crosswalk at an intersection or between intersections, pedestrians within or entering the crosswalk at either edge of the roadway shall have the right-of-way over vehicles stopped in obedience to such signs. Drivers of vehicles having so yielded the right-of-way to pedestrians entering or within the nearest crosswalk at an intersection shall also yield the right-of-way to pedestrians within any other crosswalk at the intersection.","keyword":"right of way","codeLocation":"Added Coun. J. 7-12-90, p. 18634; Amend Coun. J. 6-5-13, p. 54983, § 1","legislature":"Chicago","stub":"crosswalks_pedestrians_right_of_way"},{"id":53,"title":9,"chapter":24,"section":50,"subsection":"","header":"Pedestrians in roadway to have right-of-way when","body":"When the movement of traffic is not controlled by traffic-control devices, a police officer or traffic control aide, the operator of a vehicle shall stop and yield the right-of-way to a pedestrian crossing the roadway within a crosswalk when the pedestrian is upon the half of the roadway upon which the vehicle is traveling or when the pedestrian is approaching so closely from the opposite half of the roadway as to be in danger.","keyword":"right of way crosswalk","codeLocation":"Added Coun. J. 7-12-90, p. 18634; Amend Coun. J. 9-8-11, p. 7216, § 1","legislature":"Chicago","stub":"pedestrian_right_of_way"},{"id":55,"title":9,"chapter":36,"section":60,"subsection":"","header":"Overtaking at crosswalks","body":"Whenever any vehicle is stopped at a marked crosswalk or at any unmarked crosswalk at an intersection to permit a pedestrian to cross the roadway, the driver of any other vehicle approaching from the rear shall not overtake or pass such stopped vehicle.","keyword":"crosswalk","codeLocation":"Added Coun. J. 7-12-90, p. 18634","legislature":"Chicago","stub":"overtaking_at_crosswalks"},{"id":23,"title":9,"chapter":36,"section":10,"subsection":"c","header":"Overtaking on the left","body":"The operator of a motor vehicle overtaking a bicycle or individual proceeding in the same direction on a highway shall leave a safe distance, but not less than 3 feet, when passing the bicycle or individual and shall maintain that distance until safely past the overtaken bicycle or individual.","keyword":"three passing","codeLocation":"Added Coun. J. 3-12-08, p. 22783, § 1","legislature":"Chicago","stub":"three_feet_passing_rule"},{"id":58,"title":9,"chapter":40,"section":120,"subsection":"","header":"Obstruction of intersection or crosswalk prohibited","body":"Notwithstanding any traffic-control signal indication to proceed, no operator of a vehicle shall enter an intersection or crosswalk unless there is sufficient space beyond such intersection or crosswalk, in the direction in which the vehicle is proceeding, to accommodate the vehicle without obstructing the passage of other vehicular traffic or pedestrians. Any person who violates this section shall be subject to a fine of $200.00 and may be required to perform reasonable public service.","keyword":"","codeLocation":"Added Coun. J. 7-12-90, p. 18634; Amend Coun. J. 10-7-98, p. 78921; Amend Coun. J. 11-6-02, p. 96501, § 5; Amend Coun. J. 12-4-02, p. 100729, § 5; Amend Coun. J. 5-26-04, p. 24880, § 1","legislature":"Chicago","stub":"obstructing_crosswalk_prohibited"},{"id":25,"title":9,"chapter":40,"section":127,"subsection":"","header":"Drivers to exercise due care","body":"Every driver of a vehicle shall exercise due care to avoid colliding with any pedestrian, or any person operating a bicycle or other device propelled by human or animal power,  upon any roadway, and shall give warning by sounding the horn when necessary and shall exercise proper precautions upon observing any child or any confused or incapacitated person upon a roadway.","keyword":"","codeLocation":"Added Coun. J. 7-12-90, p. 18634; Amend Coun. J. 3-12-08, p. 22781, § 1","legislature":"Chicago","stub":"drivers_exercise_due_care"},{"id":24,"title":9,"chapter":40,"section":60,"subsection":"","header":"Driving, standing or parking on bicycle paths or lanes prohibited","body":"The driver of a vehicle shall not drive, unless entering or exiting a legal parking space, or stand, or park the vehicle upon any on-street path or lane designated by official signs or markings for the use of bicycles, or otherwise drive or place the vehicle in such a manner as to impede bicycle traffic on such path or lane.  The driver of a vehicle shall not stand or park the vehicle upon any lane designated by pavement markings for the shared use of motor vehicles and bicycles, or place the vehicle in such a manner as to impede bicycle traffic on such lane; provided, however, the driver of a bus may stop the bus in any such lane (i) at a designated bus stop for the purpose of loading or unloading of passengers, (ii) in case of an emergency; or (iii) as permitted in Section 9-48-050(d) of this Code.  In addition to the fine provided in Section 9-4-025 of this Code, any vehicle parked in violation of this section shall be subject to an immediate tow and removal to a city vehicle pound or authorized garage.","keyword":"","codeLocation":"Added Coun. J. 7-12-90, p. 18634; Amend Coun. J. 9-1-99, p. 10503, § 1; Amend Coun. J. 3-12-08, p. 22781, § 1; Amend Coun. J. 6-5-13, p. 54983, § 1","legislature":"Chicago","stub":"no_parking_in_bike_lane"},{"id":4,"title":9,"chapter":52,"section":10,"subsection":"","header":"Rights and duties","body":"<p>(a) Every bicyclist upon a roadway shall be granted all of the rights and shall be subject to all of the duties applicable to the driver of a vehicle by the laws of this state declaring rules of the road applicable to vehicles or by the traffic ordinances of this city applicable to the driver of a vehicle, except as otherwise explicitly provided in this Code, or as to those provisions of laws and ordinances which by their nature can have no application.<\/p>\n<p>(b) The regulations in the traffic code applicable to bicycles shall apply whenever a bicycle is operated upon any roadway or public sidewalk or upon any public path set aside for the use of bicycles, subject to those exceptions stated herein.<\/p>\n<p>(c) Whenever authorized signs are erected indicating that no right or left turn or turn in the opposite direction is permitted, no bicyclist shall disobey the direction of any such sign unless he dismounts from the bicycle to make the turn, in which event he shall then obey the regulations applicable to pedestrians.<\/p>\n<p>(d) Unless another fine or penalty is specifically provided in this chapter, any person who violates this chapter shall be fined not less than $50.00 nor more than $200.00 for each offense.<\/p>","keyword":"","codeLocation":"Added Coun. J. 7-12-90, p. 18634; Amend Coun. J. 11-5-08, p. 43682, § 1; Amend Coun. J. 6-5-13, p. 54983, § 1","legislature":"Chicago","stub":"rights_and_duties"},{"id":8,"title":9,"chapter":52,"section":100,"subsection":"","header":"Parent's or legal guardian's responsibility","body":"No parent or legal guardian of any child shall authorize or knowingly permit the child to violate any of the provisions of this chapter applicable to bicycles.","keyword":"","codeLocation":"Added Coun. J. 2-6-02, p. 79154, § 1","legislature":"Chicago","stub":"parents"},{"id":30,"title":9,"chapter":52,"section":110,"subsection":"","header":"Use of communication devices while operating a bicycle","body":"<p>(a) For purposes of this section only, the following definitions apply:\n<br \/>\"Communication device\" means a device, including but not limited to a wireless telephone, personal digital assistant, or a portable or mobile computer, which is designed to transmit and receive electronic messages.\n<br \/>\"Electronic message\" means a self-contained piece of digital communication that is designed or intended to be transmitted between communication devices.  An “electronic message” includes, but is not limited to electronic mail, a text message, an instant message, a command or request to access an internet site, or talking or listening to another person on the telephone or other communication device.\n<br \/>“Using” means composing, reading, sending or listening to an electronic message.<\/p>\n<p>(b) Except as otherwise provided in subsection (c) of this section, no person shall operate a bicycle while using a communication device.<\/p>\n<p>(c) The provisions of this section shall not apply to a:\n<br \/>(1) law enforcement officer or other emergency responder, when on duty and acting in his official capacity;\n<br \/>(2) person using a communication device with a “hands free” device or in a voice-activated mode, which allows the person to talk into and listen to the other party without the use of hands;\n<br \/>(3) person using a communication device for the sole purpose of reporting an emergency situation and continued communication with emergency personnel during the emergency situation; or\n<br \/>(4) person using a communication device while maintaining a bicycle in a stationary position.<\/p>\n<p>(d) Any person who violates any provision of this section shall be fined not less than $20.00 nor more than $50.00 for the first offense, not less than $50.00 nor more than $75.00 for the second offense, and not less than $75.00 nor more than $100.00 for a third or any subsequent offense.<\/p>\n<p>(e) In addition to any fine provided for in this section, if a violation of subsection (b) of this section occurs at the time of a traffic accident, the person operating the bicycle may be fined in an amount not to exceed $500.00.<\/p>","keyword":"cellphone gps","codeLocation":"Added Coun. J. 10-5-11, p. 8815, § 1; Amend Coun. J. 6-5-13, p. 54983, § 1","legislature":"Chicago","stub":"no_cellphones"},{"id":10,"title":9,"chapter":52,"section":20,"subsection":"","header":"Riding bicycles on sidewalks and certain roadways","body":"<p>(a) No person shall ride a bicycle upon a sidewalk within a business district, unless such sidewalk has been officially designated and marked as a bicycle route, or such sidewalk is used to enter the nearest roadway, intersection or designated bicycle path, or to access a bicycle share station.<\/p>\n<p>(b) No person 12 or more years of age shall ride a bicycle upon any sidewalk in any district, unless such sidewalk has been officially designated and marked as a bicycle route, or such sidewalk is used to enter the nearest roadway, intersection or designated bicycle path, or to access a bicycle share station.<\/p>\n<p>(c) Bicycles shall not be operated on Lake Shore Drive or on any roadway where the operation of bicycles has been prohibited and signs have been erected indicating such prohibition.<\/p>","keyword":"","codeLocation":"Added Coun. J. 7-12-90, p. 18634; Amend Coun. J. 6-5-13, p. 54983, § 1","legislature":"Chicago","stub":"sidewalk_riding"},{"id":9,"title":9,"chapter":52,"section":21,"subsection":"","header":"Riding bicycles on sidewalks – Penalty","body":"<p>(a) The penalty for any person age 18 and older who rides a bicycle on the sidewalk adjacent to North Sheridan Road, between West Ardmore Avenue and West Sheridan Road (6400 north) shall be as follows:\r\n<br \/>(1) the bicycle shall be temporarily disabled without permanent damage; and\r\n<br \/>(2) the violator shall be subject to a fine of $50.00.\r\n<p>(b) Following passage and approval, this section shall be in force and effect upon posting of signage notifying bicyclists of the penalty for violation of this section.<\/p>","keyword":"moore","codeLocation":"Added Coun. J. 2-6-02, p. 79154, § 1; Amend Coun. J. 6-4-03, p. 2538, § 1","legislature":"Chicago","stub":"sidewalk_riding_sheridan"},{"id":11,"title":9,"chapter":52,"section":30,"subsection":"","header":"Speed of bicycles","body":"No person shall operate a bicycle at a speed greater than is reasonable and prudent under the conditions then existing.","keyword":"","codeLocation":"Added Coun. J. 7-12-90, p. 18634","legislature":"Chicago","stub":"speeding"},{"id":12,"title":9,"chapter":52,"section":40,"subsection":"","header":"Yielding right-of-way","body":"<p>(a) The operator of a bicycle emerging from an alley, driveway or building shall, upon approaching a sidewalk or the sidewalk area extending across any alleyway, yield the right-of-way to all pedestrians approaching on the sidewalk or sidewalk area and, upon entering the roadway, shall yield the right-of-way to all vehicles approaching on the roadway.<\/p>\n<p>(b) Whenever any person is riding a bicycle upon a sidewalk, such person shall yield the right-of-way to any pedestrian and shall give audible signal before overtaking and passing such pedestrian.<\/p>\n<p>(c) Except as otherwise provided in subsection (e) of this section, any bicyclist upon a roadway at less than the normal speed of traffic at the time and place and under the conditions then existing shall ride as near as practicable and safe to the right-hand side of the roadway, except in the following circumstances:\n<br \/>(1) when overtaking another bicycle or vehicle proceeding in the same direction; or\n<br \/>(2) when preparing for a left turn; or\n<br \/>(3) when reasonably necessary to avoid conditions including, but not limited to, fixed or moving objects, parked or moving vehicles, bicycles, pedestrians, animals, surface hazards, or substandard width lanes that make it unsafe to continue along the right-hand curb or edge.  For purposes of this subsection, the term “substandard width lane” means a lane that is too narrow for a bicycle and a vehicle to travel safely side by side within the lane; or\n<br \/>(4) when approaching a place where a right turn is authorized.<\/p>\n<p>(d) Any bicyclist upon a roadway is permitted to pass on the right side of a slower-moving or standing vehicle or bicycle, but must exercise due care when doing so.  When approaching a vehicle which has discharged passengers from its right side, a bicyclist must either yield to those pedestrians or pass on the left.<\/p>\n<p>(e) Any person operating a bicycle upon a one- way roadway with two or more marked traffic lanes may\nride as near to the left-hand side of such roadway as practicable.<\/p>","keyword":"","codeLocation":"Added Coun. J. 7-12-90, p. 18634; Amend Coun. J. 6-5-13, p. 54983, § 1","legislature":"Chicago","stub":"right_of_way"},{"id":29,"title":9,"chapter":52,"section":45,"subsection":"","header":"Bicycle operator's signals - Hand and arm - Manner","body":"A bicyclist upon the roadway or upon any public path set aside for the use of bicycles shall give hand and arm signals in the following manner:\n<br \/>1. Left turn, left hand and arm extended horizontally;\n<br \/>2. Right turn, left hand and arm extended upward, or right hand and arm extended horizontally;\n<br \/>3. Stop or decrease speed, left or right hand and arm extended downward.","keyword":"","codeLocation":"Added Coun. J. 6-5-13, p. 54983, § 1","legislature":"Chicago","stub":"bike_signals"},{"id":6,"title":9,"chapter":52,"section":50,"subsection":"","header":"Riding in single file required – Exceptions","body":"Persons riding bicycles upon a roadway shall ride single file except on paths or parts of roadways set aside for the exclusive use of bicycles or except when riding two abreast does not impede the normal and reasonable movement of traffic.  Persons riding two abreast shall ride within a single lane subject to Section 9-52-040 of this Code.\n","keyword":"","codeLocation":"Added Coun. J. 7-12-90, p. 18634; Amend Coun. J. 6-5-13, p. 54983, § 1","legislature":"Chicago","stub":"single_file"},{"id":5,"title":9,"chapter":52,"section":60,"subsection":"","header":"Carrying articles on bicycles","body":"No person operating a bicycle shall carry any package, bundle or article which prevents the rider from keeping at least one hand upon the handlebars.","keyword":"cargo","codeLocation":"Added Coun. J. 7-12-90, p. 18634","legislature":"Chicago","stub":"hands_on_handlebars"},{"id":2,"title":9,"chapter":52,"section":70,"subsection":"","header":"Parking","body":"No person shall park a bicycle upon a street other than upon the roadway against the curb or upon the sidewalk against a rack, parking meter or sign pole to support the bicycle or against a building or at the curb in such manner as to afford the least obstruction to pedestrian traffic. ","keyword":"bike parking","codeLocation":"Added Coun. J. 7-12-90, p. 18634; Amend Coun. J. 7-21-04, p. 28659, § 1","legislature":"Chicago","stub":"bike_parking"},{"id":28,"title":9,"chapter":52,"section":71,"subsection":"","header":"Abandoned bicycles","body":"<p>(a) It shall be unlawful for any person to abandon any bicycle on any public way within the city. A bicycle shall be deemed abandoned if it:\n<br \/>(1) is in such a state of disrepair as to be incapable of being operated in its present condition, or\n<br \/>(2) has not been moved or used in more than seven days and bears physical indicia of having been deserted.<\/p>\r\n<p>(b) Any bicycle deemed abandoned pursuant to subsection (a) of this section may have a notice affixed to it which informs the bicycleís owner that the bicycle appears to be abandoned. The commissioner of transportation or his designee is authorized to affix such notices upon bicycles. This notice shall indicate:\r\n<br \/>(1) a telephone number for the owner to call to inform the department of transportation that the bicycle is not abandoned; and\r\n<br \/>(2) the date after which the bicycle may be removed if it is not claimed by its owner.\n<br \/>A bicycle shall not be deemed to be abandoned if the owner of the bicycle, within seven days of the affixing of a notice of abandonment, notifies the department of transportation that the bicycle is not abandoned.<\/p>\r\n<p>(c) If a bicycle is not relocated or claimed by its owner within seven days of the affixing of a notice of abandonment, that bicycle may be removed and disposed of by the commissioner of transportation or his designee.<\/p>","keyword":"","codeLocation":"Added Coun. J. 7-21-04, p. 28659, § 1","legislature":"Chicago","stub":"abandoned_bikes"},{"id":7,"title":9,"chapter":52,"section":80,"subsection":"","header":"Head lamps, reflectors and brakes","body":"<p>(a) Every bicycle when in use at nighttime shall be equipped with a head lamp which shall emit a white light visible from a minimum distance of 500 feet from the front and with a rear red reflector capable of reflecting the head lamp beams of an approaching motor vehicle back to the operator of such vehicle at distances up to 200 feet or a rear lamp emitting a red light visible from a distance of at least 200 feet from the rear.<\/p>\r\n<p>(b) Every bicycle shall be equipped with a brake that will enable the operator to make the braked wheel skid on dry, level, clean pavement.<\/p>","keyword":"headlight lights night","codeLocation":"Added Coun. J. 7-12-90, p. 18634","legislature":"Chicago","stub":"headlight_required"},{"id":3,"title":9,"chapter":52,"section":90,"subsection":"","header":"Riding regulations","body":"<p>(a) A person propelling a bicycle shall not ride other than astride a permanent and regular seat attached thereto.<\/p>\r\n<p>(b) No bicycle shall be used to carry more persons at one time than the number for which it is designed and equipped.<\/p>","keyword":"passenger double","codeLocation":"Added Coun. J. 7-12-90, p. 18634","legislature":"Chicago","stub":"passengers"},{"id":54,"title":9,"chapter":60,"section":50,"subsection":"","header":"Pedestrians to yield right-of-way when","body":"<p>(a) Every pedestrian crossing a roadway at any point other than within a crosswalk shall yield the right-of-way to all vehicles upon the roadway.<\/p>\n<p>(b) The foregoing rules in this section have no application under the conditions stated in Section 9-60-010 when pedestrians are prohibited from crossing at certain designated places.<\/p>","keyword":"right of way crosswalk","codeLocation":"Added Coun. J. 7-12-90, p. 18634; Amend Coun. J. 6-5-13, p. 54983, § 1","legislature":"Chicago","stub":"pedestrian_yield_right_of_way"},{"id":60,"title":9,"chapter":60,"section":120,"subsection":"","header":"Pedestrians to exercise due care","body":"Nothing in this chapter shall relieve a pedestrian from the duty of exercising due care.","keyword":"","codeLocation":"Coun. J. 7-12-90, p. 18634","legislature":"Chicago","stub":"pedestrians_due_care"},{"id":27,"title":9,"chapter":80,"section":35,"subsection":"","header":"Opening and closing vehicle doors","body":"No person shall open the door of a vehicle on the side available to moving traffic unless and until it is reasonably safe to do so, and can be done without interfering with the movement of other traffic, nor shall any person leave a door open on the side of a vehicle available to moving traffic for a period of time longer than necessary to load or unload passengers.","keyword":"dooring","codeLocation":"Added Coun. J. 3-12-08, p. 22786","legislature":"Chicago","stub":"no_dooring"},{"id":13,"title":9,"chapter":120,"section":10,"subsection":"","header":"Definition","body":"The word \"bicycle\" as used in this chapter means every vehicle propelled by human power upon which any person may ride, having at least two tandem wheels either of which is 20 inches or over in diameter.","keyword":"","codeLocation":"Prior code § 29.1-1; Amend Coun. J. 7-12-90, p. 18634","legislature":"Chicago","stub":"bike_defined"},{"id":14,"title":9,"chapter":120,"section":20,"subsection":"","header":"Registration","body":"It is hereby made the duty of the owner of every bicycle, before operating or permitting the operation of the same upon any public way within the city, to register said vehicle with the commissioner of police on a form provided for such purpose. Registration may be accomplished by filing the registration record or form, duly filled out, in the office of the commander of the police district in which the bicycle owner resides, or by mailing said form, duly filled out, postage prepaid, to the commissioner of police.","keyword":"","codeLocation":"Prior Registration code § 29.1-2; Amend Coun. J. 7-12-90, p. 18634","legislature":"Chicago","stub":"registration_required"},{"id":15,"title":9,"chapter":120,"section":30,"subsection":"","header":"Registration record","body":"The registration record shall be in size and style as prescribed by the commissioner of police and shall contain the date of registration, the make, serial number, model and description of the bicycle registered, the name and residence address of the owner, the signature of the owner, the owner's age, and if such owner is under 21 years of age, the name and address of his or her parent or guardian, the name and address of the person from whom purchased, the date of purchase, and such additional information as the commissioner of police may require.","keyword":"","codeLocation":"Prior code § 29.1-3; Amend Coun. J. 7-12-90, p. 18634","legislature":"Chicago","stub":"registration_form"},{"id":16,"title":9,"chapter":120,"section":40,"subsection":"","header":"Sale or transfer","body":"Upon the sale or transfer of any bicycle registered hereunder, it shall be the duty of the purchaser, within ten days of the date of such sale or transfer, to register such bicycle in his name in manner provided for in the case of an original registrant.","keyword":"","codeLocation":"Prior code § 29.1-4; Amend Coun. J. 7-12-90, p. 18634","legislature":"Chicago","stub":"register_after_sale"},{"id":17,"title":9,"chapter":120,"section":50,"subsection":"","header":"Alteration of serial number prohibited","body":"It shall be unlawful to destroy, remove, alter, cover or deface the manufacturer's serial number on any bicycle. It shall be unlawful for any person to own or have custody of a bicycle, the original manufacturer's serial number of which has been destroyed, removed, altered, covered or defaced. Any person who violates any of the provisions of this section shall be fined not more than $200.00 for each offense.","keyword":"","codeLocation":"Prior code § 29.1-5; Amend Coun. J. 7-12-90, p. 18634","legislature":"Chicago","stub":"dont_change_serial"},{"id":18,"title":9,"chapter":120,"section":60,"subsection":"","header":"Traffic regulations to apply","body":"No person shall operate any bicycle upon the public ways or other places in this city in violation of any of the applicable provisions of Title 9 of this Code.","keyword":"","codeLocation":"Prior code § 29.1-6; Amend Coun. J. 7-12-90, p. 18634","legislature":"Chicago","stub":"bicyclists_follow_road_rules"},{"id":19,"title":9,"chapter":120,"section":70,"subsection":"","header":"Rental agencies","body":"A rental agency shall not rent or offer any bicycle for rent unless the bicycle is registered in accordance with the requirements of this chapter providing therefore.","keyword":"","codeLocation":"Prior code § 29.1-7; Amend Coun. J. 7-12-90, p. 18634","legislature":"Chicago","stub":"bike_rental"},{"id":20,"title":9,"chapter":120,"section":80,"subsection":"","header":"Bicycle dealers","body":"Every person engaged in the business of buying or selling new or second hand bicycles shall make a report to the commissioner of police of every bicycle purchased or sold by such dealer, giving the name and address of the person from whom purchased or to whom sold, a description of such bicycle by name or make, the frame number thereof, and the registration number, if any, found thereon.","keyword":"","codeLocation":"Prior code § 29.1-8; Amend Coun. J. 7-12-90, p. 18634","legislature":"Chicago","stub":"bike_dealers_must_register_bikes"},{"id":34,"title":1,"chapter":1,"section":106,"subsection":"","header":"Bicycle","body":"Every device propelled by human power upon which any person may ride, having two tandem wheels except scooters and similar devices.","keyword":"","codeLocation":"P.A. 85-951","legislature":"Illinois","stub":"bike_defined"},{"id":52,"title":4,"chapter":2,"section":127,"subsection":"","header":"Bicycle and pedestrian ways","body":"<p>(a) Bicycle and pedestrian ways shall be given full consideration in the planning and development of transportation facilities, including the incorporation of such ways into State plans and programs. <\/p>\r\n<p>(b) In or within one mile of an urban area, bicycle and pedestrian ways shall be established in conjunction with the construction, reconstruction, or other change of any State transportation facility except:\r\n<br \/>(1) in pavement resurfacing projects that do not widen the existing traveled way or do not provide stabilized shoulders; or\r\n<br \/>(2) where approved by the Secretary of Transportation based upon documented safety issues, excessive cost or absence of need.<\/p>\r\n<p>(c) Bicycle and pedestrian ways may be included in pavement resurfacing projects when local support is evident or bicycling and walking accommodations can be added within the overall scope of the original roadwork.<\/p>\r\n<p>(d) The Department shall establish design and construction standards for bicycle and pedestrian ways. Beginning July 1, 2007, this Section shall apply to planning and training purposes only. Beginning July 1, 2008, this Section shall apply to construction projects.<\/p>","keyword":"complete streets","codeLocation":"P.A. 95-0665","legislature":"Illinois","stub":"complete_streets_law"},{"id":51,"title":11,"chapter":7,"section":127,"subsection":"","header":"Overtaking a vehicle on the left","body":"<p>The following rules govern the overtaking and passing of vehicles proceeding in the same direction, subject to those limitations, exceptions, and special rules otherwise stated in this Chapter:<\/p>\r\n<p>(a) The driver of a vehicle overtaking another vehicle proceeding in the same direction shall pass to the left thereof at a safe distance and shall not again drive to the right side of the roadway until safely clear of the overtaken vehicle. In no event shall such movement be made by driving off the pavement or the main traveled portion of the roadway.<\/p>\r\n<p>(b) Except when overtaking and passing on the right is permitted, the driver of an overtaken vehicle shall give way to the right in favor of the overtaking vehicle on audible signal and shall not increase the speed of his vehicle until completely passed by the overtaking vehicle.<\/p>\r\n<p>(c) The driver of a 2 wheeled vehicle may not, in passing upon the left of any vehicle proceeding in the same direction, pass upon the right of any vehicle proceeding in the same direction unless there is an unobstructed lane of traffic available to permit such passing maneuver safely.<\/p>\r\n<p>(d) The operator of a motor vehicle overtaking a bicycle or individual proceeding in the same direction on a highway shall leave a safe distance, but not less than 3 feet, when passing the bicycle or individual and shall maintain that distance until safely past the overtaken bicycle or individual.<\/p>","keyword":"three feet","codeLocation":"P.A. 95-231, eff. 1-1-08","legislature":"Illinois","stub":"three_feet_passing"},{"id":49,"title":11,"chapter":8,"section":127,"subsection":"","header":"Required position and method of turning","body":"<p>(a) The driver of a vehicle intending to turn at an intersection shall do so as follows:\r\n<br \/>(1) Both the approach for a right turn and a right turn shall be made as close as practical to the right hand curb or edge of the roadway. \r\n<br \/>(2) The driver of a vehicle intending to turn left at any intersection shall approach the intersection in the extreme left hand lane lawfully available to traffic moving in the direction of travel of such vehicle, and after entering the intersection, the left turn shall be made so as to leave the intersection in a lane lawfully available to traffic moving in such direction upon the roadway being entered. Whenever practicable the left turn shall be made in that portion of the intersection to the left of the center of the intersection. \r\n<br \/>(3) The Department and local authorities in their respective jurisdictions may cause official traffic control devices to be placed within or adjacent to intersections and thereby require and direct that a different course from that specified in this Section be traveled by vehicles turning at an intersection, and when such devices are so placed no driver of a vehicle shall turn a vehicle at an intersection other than as directed and required by such devices.<\/p>\r\n<p>(b) Two way left turn lanes. Where a special lane for making left turns by drivers proceeding in opposite directions has been indicated by official traffic control devices: \r\n<br \/>(1) A left turn shall not be made from any other lane. \r\n<br \/>(2) A vehicle shall not be driven in the lane except when preparing for or making a left turn from or into the roadway or when preparing for or making a U turn when otherwise permitted by law.<\/p>\r\n<p>(c) When a motor vehicle and a mass transit bus are traveling in the same direction on the same multi laned highway, street or road, the operator of the motor vehicle overtaking such bus, which is stopped at an intersection on the right side of the roadway to receive or discharge passengers, shall pass to the left of the bus at a safe distance and shall not turn to the right in front of the bus at that intersection.<\/p>","keyword":"","codeLocation":"P.A. 85-786","legislature":"Illinois","stub":"turning"},{"id":50,"title":11,"chapter":8,"section":127,"subsection":"","header":"Method of giving hand and arm signals","body":"<p>Method of giving hand and arm signals. All signals herein required given by hand and arm shall be given from the left side of the vehicle in the following manner and such signals shall indicate as follows: \r\n<br \/>1. Left turn: Hand and arm extended horizontally. \r\n<br \/>2. Right turn: Hand and arm extended upward, except that a person operating a bicycle may extend the right hand and arm horizontally and to the right side of the bicycle.\r\n<br \/>3. Stop or decrease of speed: Hand and arm extended downward.<\/p>","keyword":"","codeLocation":"P.A. 95-231, eff. 1-1-08","legislature":"Illinois","stub":"bike_signals_method"},{"id":42,"title":11,"chapter":14,"section":127,"subsection":"","header":"Opening and closing vehicle doors","body":"No person shall open the door of a vehicle on the side available to moving traffic unless and until it is reasonably safe to do so, and can be done without interfering with the movement of other traffic, nor shall any person leave a door open on the side of a vehicle available to moving traffic for a period of time longer than necessary to load or unload passengers.","keyword":"dooring","codeLocation":"P.A. 79-1069","legislature":"Illinois","stub":"no_dooring"},{"id":31,"title":11,"chapter":15,"section":127,"subsection":"","header":"Application of rules","body":"<p>(a) It is unlawful for any person to do any act forbidden or fail to perform any act required in Article XV of Chapter 11 of this Code [625 ILCS 5\/11-1501 et seq.].<\/p>\n<p>(b) The parent of any child and the guardian of any ward shall not authorize or knowingly permit any such child or ward to violate any of the provisions of this Code.<\/p>","keyword":"","codeLocation":"P.A. 82-132","legislature":"Illinois","stub":"bicyclists_follow_road_rules"},{"id":32,"title":11,"chapter":15,"section":127,"subsection":"","header":"Bicycle identifying number","body":"A person engaged in the business of selling bicycles at retail shall not sell any bicycle unless the bicycle has an identifying number permanently stamped or cast on its frame.","keyword":"","codeLocation":"P.A. 82-132","legislature":"Illinois","stub":"serial_number"},{"id":33,"title":11,"chapter":15,"section":127,"subsection":"","header":"Bicycle racing","body":"<p>(a) Bicycle racing on a highway shall not be unlawful when a racing event has been approved by State or local authorities on any highway under their respective jurisdictions. Approval of bicycle highway racing events shall be granted only under conditions which assure reasonable safety for all race participants, spectators and other highways users, and which prevent unreasonable interference with traffic flow which would seriously inconvenience other highway users.<\/p>\n<p>(b) By agreement with the approving authority, participants in an approved bicycle highway racing event may be exempted from compliance with any traffic laws otherwise applicable thereto, provided that traffic control is adequate to assure the safety of all highway users.<\/p>","keyword":"race cyclocross","codeLocation":"P.A. 82-132","legislature":"Illinois","stub":"bike_racing"},{"id":35,"title":11,"chapter":15,"section":127,"subsection":"","header":"Bicycles on sidewalks","body":"<p>(a) A person propelling a bicycle upon and along a sidewalk, or across a roadway upon and along a crosswalk, shall yield the right of way to any pedestrian and shall give audible signal before overtaking and passing such pedestrian.<\/p>\n<p>(b) A person shall not ride a bicycle upon and along a sidewalk, or across a roadway upon and along a crosswalk, where such use of bicycles is prohibited by official traffic-control devices.<\/p>\n<p>(c) A person propelling a bicycle upon and along a sidewalk, or across a roadway upon and along a crosswalk, shall have all the rights and duties applicable to a pedestrian under the same circumstances.<\/p>","keyword":"","codeLocation":"P.A. 82-132","legislature":"Illinois","stub":"sidewalk_riding"},{"id":36,"title":11,"chapter":15,"section":127,"subsection":"","header":"Carrying articles","body":"No person operating a bicycle shall carry any package, bundle or article which prevents the use of both hands in the control and operation of the bicycle. A person operating a bicycle shall keep at least one hand on the handlebars at all times.","keyword":"cargo","codeLocation":"P.A. 82-132","legislature":"Illinois","stub":"hand_on_handlebar"},{"id":37,"title":11,"chapter":15,"section":127,"subsection":"","header":"Commercial Messengers","body":"No person, firm, or corporation shall operate a commercial bicycle messenger service in a city with a population of more than 2,000,000 unless the bicycles used are covered by a liability insurance policy at the expense of the person, firm, or corporation. The insurance policy shall be issued in amounts no less than the minimum amounts set for bodily injury or death and for destruction of property under Section 7-203 of this Code [625 ILCS 5\/7-203]. No insurer other than an insurer authorized to do business in this State shall issue a policy under this Section.","keyword":"bike messenger","codeLocation":"P.A. 87-1203","legislature":"Illinois","stub":"messengers"},{"id":38,"title":11,"chapter":15,"section":127,"subsection":"","header":"Clinging to vehicles","body":"No person riding upon any bicycle, coaster, roller skates, sled or toy vehicle shall attach the same or himself to any vehicle upon a roadway.","keyword":"","codeLocation":"P.A. 82-132","legislature":"Illinois","stub":"no_skitching"},{"id":39,"title":11,"chapter":15,"section":127,"subsection":"","header":"Inspecting bicycles","body":"A uniformed police officer may at any time upon reasonable cause to believe that a bicycle is unsafe or not equipped as required by law, or that its equipment is not in proper adjustment or repair, require the person riding the bicycle to stop and submit the bicycle to an inspection and such test with reference thereto as may be appropriate.","keyword":"","codeLocation":"P.A. 82-132","legislature":"Illinois","stub":"bike_inspections"},{"id":40,"title":11,"chapter":15,"section":127,"subsection":"","header":"Lamps and other equipment on bicycles","body":"<p>(a) Every bicycle when in use at nighttime shall be equipped with a lamp on the front which shall emit a white light visible from a distance of at least 500 feet to the front and with a red reflector on the rear of a type approved by the Department which shall be visible from all distances from 100 feet to 600 feet to the rear when directly in front of lawful lower beams of headlamps on a motor vehicle. A lamp emitting a red light visible from a distance of 500 feet to the rear may be used in addition to the red reflector.<\/p>\r\n<p>(b) A bicycle shall not be equipped with nor shall any person use upon a bicycle any siren. This subsection (b) does not apply to a bicycle that is a police vehicle or fire department vehicle.<\/p>\r\n<p>(c) Every bicycle shall be equipped with a brake which will adequately control movement of and stop and hold such bicycle.<\/p>\r\n<p>(d) No person shall sell a new bicycle or pedal for use on a bicycle that is not equipped with a reflex reflector conforming to specifications prescribed by the Department, on each pedal, visible from the front and rear of the bicycle during darkness from a distance of 200 feet.<\/p>\r\n<p>(e) No person shall sell or offer for sale a new bicycle that is not equipped with side reflectors. Such reflectors shall be visible from each side of the bicycle from a distance of 500 feet and shall be essentially colorless or red to the rear of the center of the bicycle and essentially colorless or amber to the front of the center of the bicycle provided. The requirements of this paragraph may be met by reflective materials which shall be at least 3\/16 of an inch wide on each side of each tire or rim to indicate as clearly as possible the continuous circular shape and size of the tires or rims of such bicycle and which reflective materials may be of the same color on both the front and rear tire or rim. Such reflectors shall conform to specifications prescribed by the Department.<\/p>\r\n<p>(f) No person shall sell or offer for sale a new bicycle that is not equipped with an essentially colorless front-facing reflector.<\/p>","keyword":"lights headlights night","codeLocation":"P.A. 95-28, eff. 8-7-07","legislature":"Illinois","stub":"headlight_required"},{"id":41,"title":11,"chapter":15,"section":127,"subsection":"","header":"Left turns","body":"<p>(a) A person riding a bicycle or motorized pedalcycle intending to turn left shall follow a course described in Section 11-801 or in paragraph (b) of this Section.<\/p>\n<p>(b) A person riding a bicycle or motorized pedalcycle intending to turn left shall approach the turn as close as practicable to the right curb or edge of the roadway. After proceeding across the intersecting roadway to the far corner of the curb or intersection of the roadway edges, the bicyclist or motorized pedalcycle driver shall stop, as much as practicable out of the way of traffic. After stopping the person shall yield to any traffic proceeding in either direction along the roadway such person had been using. After yielding, the bicycle or motorized pedalcycle driver shall comply with any official traffic control device or police officer regulating traffic on the highway along which he intends to proceed, and the bicyclist or motorized pedalcycle driver may proceed in the new direction.<\/p>\n<p>(c) Notwithstanding the foregoing provisions, the Department and local authorities in their respective jurisdictions may cause official traffic-control devices to be placed and thereby require and direct that a specific course be traveled by turning bicycles and motorized pedalcycles, and when such devices are so placed, no person shall turn a bicycle or motorized pedalcycle other than as directed and required by such devices.<\/p>","keyword":"","codeLocation":"P.A. 85-951","legislature":"Illinois","stub":"turning_left"},{"id":43,"title":11,"chapter":15,"section":127,"subsection":"","header":"Bicycle parking","body":"<p>(a) A person may park a bicycle on a sidewalk unless prohibited or restricted by an official traffic-control device.<\/p>\n<p>(b) A bicycle parked on a sidewalk shall not impede the normal and reasonable movement of pedestrian or other traffic.<\/p>\n<p>(c) A bicycle may be parked on the roadway at any angle to the curb or edge of the roadway at any location where parking is allowed.<\/p>\n<p>(d) A bicycle may be parked on the roadway abreast of another bicycle or bicycles near the side of the roadway at any location where parking is allowed.<\/p>\n<p>(e) A person shall not park a bicycle on a roadway in such a manner as to obstruct the movement of a legally parked motor vehicle.<\/p>\n<p>(f) In all other respects, bicycles parked anywhere on a highway shall conform with the provisions of this Code regulating the parking of vehicles.<\/p>","keyword":"","codeLocation":"P.A. 82-132","legislature":"Illinois","stub":"bike_parking"},{"id":44,"title":11,"chapter":15,"section":127,"subsection":"","header":"Position of bicycles and motorized pedal cycles on roadways - Riding on roadways and bicycle paths","body":"<p>(a) Any person operating a bicycle or motorized pedal cycle upon a roadway at less than the normal speed of traffic at the time and place and under the conditions then existing shall ride as close as practicable and safe to the right hand curb or edge of the roadway except under the following situations:\r\n<br \/>1. When overtaking and passing another bicycle, motorized pedal cycle or vehicle proceeding in the same direction; or\r\n<br \/>2. When preparing for a left turn at an intersection or into a private road or driveway; or\r\n<br \/>3. When reasonably necessary to avoid conditions including, but not limited to, fixed or moving objects, parked or moving vehicles, bicycles, motorized pedal cycles, pedestrians, animals, surface hazards, or substandard width lanes that make it unsafe to continue along the right hand curb or edge. For purposes of this subsection, a \"substandard width lane\" means a lane that is too narrow for a bicycle or motorized pedal cycle and a vehicle to travel safely side by side within the lane.\r\n<br \/>4. When approaching a place where a right turn is authorized.<\/p>\r\n<p>(b) Any person operating a bicycle or motorized pedal cycle upon a one way highway with two or more marked traffic lanes may ride as near the left hand curb or edge of such roadway as practicable.<\/p>","keyword":"","codeLocation":"P.A. 95 231, eff. 1 1 08","legislature":"Illinois","stub":"bicycling_position_on_roadway"},{"id":45,"title":11,"chapter":15,"section":127,"subsection":"","header":"Riding on bicycles","body":"<p>(a) A person propelling a bicycle shall not ride other than upon or astride a permanent and regular seat attached thereto.<\/p>\n<p>(b) No bicycle shall be used to carry more persons at one time than the number for which it is designed and equipped, except that an adult rider may carry a child securely attached to his person in a back pack or sling.<\/p>","keyword":"passenger","codeLocation":"P.A. 82-132","legislature":"Illinois","stub":"passengers"},{"id":46,"title":11,"chapter":15,"section":127,"subsection":"","header":"Don't ride more than 2 abreast","body":"Persons riding bicycles or motorized pedal cycles upon a roadway shall not ride more than 2 abreast, except on paths or parts of roadways set aside for their exclusive use. Persons riding 2 abreast shall not impede the normal and reasonable movement of traffic and, on a laned roadway, shall ride within a single lane subject to the provisions of Section 11-1505.","keyword":"single file","codeLocation":"P.A. 83-549","legislature":"Illinois","stub":"single_file"},{"id":47,"title":11,"chapter":15,"section":127,"subsection":"","header":"Traffic laws apply to persons riding bicycles","body":"Every person riding a bicycle upon a highway shall be granted all of the rights and shall be subject to all of the duties applicable to the driver of a vehicle by this Code, except as to special regulations in this Article XV [625 ILCS 5\/11-1501 et seq.] and except as to those provisions of this Code which by their nature can have no application.","keyword":"","codeLocation":"P.A. 82-132","legislature":"Illinois","stub":"rights_and_duties"},{"id":48,"title":11,"chapter":15,"section":127,"subsection":"","header":"Turn and stop signals","body":"<p>(a) Except as provided in this Section, a person riding a bicycle shall comply with Section 11-804 [625 ILCS 5\/11-804].<\/p>\n<p>(b) A signal of intention to turn right or left when required shall be given during not less than the last 100 feet traveled by the bicycle before turning, and shall be given while the bicycle is stopped waiting to turn. A signal by hand and arm need not be given continuously if the hand is needed in the control or operation of the bicycle.<\/p>","keyword":"","codeLocation":"P.A. 82-132","legislature":"Illinois","stub":"bike_signals"}]}